In [1]:
#missing data is commonly encountered in Datasets. Pandas uses the NaN (not a number)
#as the sentinel value to deal with it
import numpy as np
from numpy import nan as NA
import pandas as pd
np.set_printoptions(suppress=True)

In [2]:
#detecting np.nan values
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [7]:
assert string_data.isnull().all() == string_data.notnull().all()

In [8]:
#filtering out missing data
from numpy import nan as NA

#dropna can be helpful, returning the series with missing values removed.

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
#DataFrames: we may want to drop rows that are all NA, or that have any NA values
#default behavior: drops rows containing an NA value.
data = pd.DataFrame([[1, 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
#passing 'any' will achieve the same result.
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
#how to delete from axis #1
#let's set the value of data[4] to 0
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
#drop rows containing only a certain number of values using the df.dropna(thresh=*arg*) argument
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.041188 -0.408557 -0.025367
1  0.543167  0.554148 -0.351484
2 -0.195412  1.555169 -0.894535
3  1.163291  0.163809 -0.147316
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [18]:
#set some values to random
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0 -0.041188       NaN       NaN
1  0.543167       NaN       NaN
2 -0.195412       NaN -0.894535
3  1.163291       NaN -0.147316
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [20]:
df.dropna()

          0         1         2
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [21]:
df.dropna(thresh=1)

          0         1         2
0 -0.041188       NaN       NaN
1  0.543167       NaN       NaN
2 -0.195412       NaN -0.894535
3  1.163291       NaN -0.147316
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -0.195412       NaN -0.894535
3  1.163291       NaN -0.147316
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [23]:
#filling in missing data
df

          0         1         2
0 -0.041188       NaN       NaN
1  0.543167       NaN       NaN
2 -0.195412       NaN -0.894535
3  1.163291       NaN -0.147316
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [24]:
df.fillna(0)

          0         1         2
0 -0.041188  0.000000  0.000000
1  0.543167  0.000000  0.000000
2 -0.195412  0.000000 -0.894535
3  1.163291  0.000000 -0.147316
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [25]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.041188  0.500000  0.000000
1  0.543167  0.500000  0.000000
2 -0.195412  0.500000 -0.894535
3  1.163291  0.500000 -0.147316
4  1.398023  0.649540  1.360444
5  0.682057 -0.697450  1.188942
6 -0.041761  0.892589  0.228454

In [26]:
#we can also use these interpolation methods similar to reindexing the data
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df

          0         1         2
0  1.424986  0.887308 -0.885589
1  1.135254  1.226414  0.361721
2 -0.719370  0.651489 -0.051066
3  0.944568  0.273399 -1.465441
4  0.419197 -0.760010 -0.759320
5  2.603678  2.299346  0.908992

In [27]:
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

In [28]:
df

          0         1         2
0  1.424986  0.887308 -0.885589
1  1.135254  1.226414  0.361721
2 -0.719370       NaN -0.051066
3  0.944568       NaN -1.465441
4  0.419197       NaN       NaN
5  2.603678       NaN       NaN

In [29]:
df.fillna(method='ffill')

          0         1         2
0  1.424986  0.887308 -0.885589
1  1.135254  1.226414  0.361721
2 -0.719370  1.226414 -0.051066
3  0.944568  1.226414 -1.465441
4  0.419197  1.226414 -1.465441
5  2.603678  1.226414 -1.465441

In [30]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.424986  0.887308 -0.885589
1  1.135254  1.226414  0.361721
2 -0.719370  1.226414 -0.051066
3  0.944568  1.226414 -1.465441
4  0.419197       NaN -1.465441
5  2.603678       NaN -1.465441

In [31]:
#Other things with fillna include data imputation using median and mean
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [33]:
data.fillna(data.median())

0    1.0
1    3.5
2    3.5
3    3.5
4    7.0
dtype: float64

In [34]:
data.fillna(data.kurtosis())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [35]:
data.fillna(data.std())

0    1.000000
1    3.013857
2    3.500000
3    3.013857
4    7.000000
dtype: float64

In [36]:
#data transformation
#removing duplicates 
data = pd.DataFrame({'k1': ['one', 'two']*3+['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
#The duplicated method returns a boolean series that tells if a row is a duplicate
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [38]:
#drop_duplicates returns a dataframe with rows where duplicated "False" is filtered out
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [39]:
#drop_duplicates gives a subset option to select columns
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
#duplicated and drop_duplicates keep the first value observed.
#We can use the keep argument to keep the last row
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [42]:
#transforming data using a function/mapping
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon',
                              'pastrami','corned beef', 'bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
#let's suppose we need to add a c_tolumn indicating the type of animal from which each food came
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [44]:
#the map method on a series (also discussed in "function application and mapping") accepts
#a function or dictionary like object containing a mapping to do the transformation of values.
data['animal'] = data['food'].map(meat_to_animal)

In [45]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
#we can also pass a function that does all the work
def get_animal(x):
    return meat_to_animal[x]

data['food'].map(get_animal)

#map is a good way to perform element-wise transformations and other data-cleaning related operations

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [47]:
#replacing values: use replace to replace values (fillna is a special case of replacing null values)
data = pd.Series([1., -999., 2., -999.,-1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [48]:
#-999 values might be sentinel data
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
#to replace multiple values at the same time, pass in a list with the substitute value at the end
data.replace([-999, 1000], np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
#to use a different replacement for each value, pass a list of substitutes
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
#we can also use a dictionary
data.replace({-999: np.nan, -1000: 0})
#note data.str.replace is different than data.replace

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
#Renaming axis indices
#we can name an axis index
data = pd.DataFrame(np.arange(12).reshape((3, 4)))
data

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [53]:
#Renaming axis indices
#we can name an axis index
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'])
data

          0  1   2   3
Ohio      0  1   2   3
Colorado  4  5   6   7
New York  8  9  10  11

In [54]:
#Renaming axis indices
#we can name an axis index
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   columns=['one', 'two', 'three', 'four'])
data

   one  two  three  four
0    0    1      2     3
1    4    5      6     7
2    8    9     10    11

In [55]:
#Renaming axis indices
#we can name an axis index
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [56]:
#like series, axes also have a map method
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [57]:
#We can then assign to the index attribute, modifying the DataFrame in place.
data.index = data.index.map(transform)

In [58]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
#if we want to create a transformed version of the dataset (without modifying the original), then we should use rename.
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [60]:
#we can also use rename with a dictionary-like object
data.rename(index={'OHIO': 'INDIANA'},
             columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [61]:
#discretization and binning, e.g. for histograms
#e.g. age buckets
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

#goal is to divide ages into discrete age buckets.
#1) 18 to 25, #2) 26 to 35, #3) 36 to 60, #4) 61 and older
bins= [18, 25, 35, 60, 100]

age_categories = pd.cut(ages, bins)

In [62]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [63]:
age_categories.codes #the category in which we find each item

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [64]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [65]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [66]:
type(age_categories.categories[0])

pandas._libs.interval.Interval

In [67]:
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [68]:
#pd.cut(age_categories, bins=4)